src/ChartsOfCalculationTypes/ДополнительныеНачисленияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>ДополнительныеНачисленияОрганизаций</Name>
			<BaseCalculationTypes>
				<xr:Item>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</xr:Item>
				<xr:Item>ChartOfCalculationTypes.ДополнительныеНачисленияОрганизаций</xr:Item>
			</BaseCalculationTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаОплатыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПоСт255НК</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаЕСН</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходСтрах</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКатегорияРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьКатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПремии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПремии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоэффициентыСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяДоходомВНатуральнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетВводаТарифногоРазряда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияОтраженияВУчете</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегииОтраженияВРеглУчетеНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходЕдиныйПлатеж</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоходыОтчислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыЕСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резервируется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтнесенияЗП</Name>
					<Comment>Тип отнесения ЗП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыОтнесенияЗП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяФормулаРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЕжегодногоОтпуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЕжегодныхОтпусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрацииКакБазовый</Name>
					<Comment>Период регистрации как базовый</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчисленияНаППС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходыФСС_НС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособИспользованияВидаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетОтработанногоВремени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходитВПрочиеНачисления</Name>
					<Comment>Входит в прочие начисления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повышения</Name>
					<Comment>Повышения тарифного коэффициента</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Надбавки</Name>
					<Comment>Надбавки к окладу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доплаты</Name>
					<Comment>Доплаты к окладу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяУправленческогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьяУправленческогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыводитьПоказательРасчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРублейЧ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДоход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаОтчета6тОСоставеЗарплаты</Name>
					<Comment>Свэй,  Задача  СВФР-002328</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтрокиОтчета6тОСоставеЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочееОтражениеКтЗатратногоСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗатратныйСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьвФЗП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзПрибыли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛьготаПоФСЗН500Код</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОблагаемыйВРЛьготаПоФСЗН500Код</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ДополнительныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПоПериодуРегистрацииДля12т</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельныйУчетЛьготы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоФОТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеРаспределятьПоНаряду</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подоходный2023</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодДоходаПодоходный2023</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагВыплатыПенсионерам</Name>
					<Comment>Без формирования свода, доп. начислений и взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Годовая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеактуальноеНачисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ППСНаРуки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиСхемМотивации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапрашиватьПриКадровыхПеремещениях</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыВРДляОтражения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

src/Enums/СтратегииОтраженияВРеглУчетеНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтратегииОтраженияВРеглУчетеНачислений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВидуРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоНаНачалоСобытия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакБазовыеНачисления</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыПремии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПремии</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Премия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодоваяПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолугодоваяПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвартальнаяПремия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияВРезерв</Name>
					<Comment>Премия подлежащая резервированию</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияИзРезерва</Name>
					<Comment>Выплата зарезервированной премии</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоТрудовомуЗаконодательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКолдоговору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ChartsOfCalculationTypes/ДополнительныеНачисленияОрганизаций/Ext/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура УточнитьСтратегиюОтраженияВУчете() Экспорт

	СтратегияОтраженияВУчете = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,?(СпособОтраженияВБухучете.Пустая(), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ВидПремии = Перечисления.ВидыПремии.НеПремия И ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Перечисления.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка.ПоТрудовомуЗаконодательству Тогда
			ЧислоМесяцев = 0
		КонецЕсли;
		УточнитьСтратегиюОтраженияВУчете();
		//ПСА 21-12-2020 СВФР-006967 +++
		Если не ЗначениеЗаполнено(ЗатратныйСчет) Тогда
			ПрочееОтражениеКтЗатратногоСчета = Ложь;
		КонецЕсли;	
		//+++ПСА 21-12-2020 СВФР-006967
		
		
	КонецЕсли;
КонецПроцедуры
